Tekla Open API Reference for Tekla Structures 2025
BoltName Class
 The BoltName class contains the name of the bolt item.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.BoltName
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public sealed class BoltName
Public NotInheritable Class BoltName
The BoltName type exposes the following members.
Constructors
Name | Description
BoltName
Initializes a new instance of the BoltName class
Top
Properties
Name | Description
Name
 The bolt item name.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace